espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/lcd_cam_eco5_struct.h
/** Type of cam_rgb_yuv register
 *  CAM YUV/RGB converter configuration register.
 */
typedef union {
    struct {
        uint32_t reserved_0:21;
        /** cam_conv_8bits_data_inv : R/W; bitpos: [21]; default: 0;
         *  1:invert every two 8bits input data. 2. disabled.
         */
        uint32_t cam_conv_8bits_data_inv:1;
        /** cam_conv_yuv2yuv_mode : R/W; bitpos: [23:22]; default: 3;
         *  0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv mode,
         *  trans_mode must be set to 1.
         */
        uint32_t cam_conv_yuv2yuv_mode:2;
        /** cam_conv_yuv_mode : R/W; bitpos: [25:24]; default: 0;
         *  0: yuv422. 1: yuv420. 2: yuv411. When in yuv2yuv mode, yuv_mode decides the yuv
         *  mode of Data_in
         */
        uint32_t cam_conv_yuv_mode:2;
        /** cam_conv_protocol_mode : R/W; bitpos: [26]; default: 0;
         *  0:BT601. 1:BT709.
         */
        uint32_t cam_conv_protocol_mode:1;
        /** cam_conv_data_out_mode : R/W; bitpos: [27]; default: 0;
         *  LIMIT or FULL mode of Data out. 0: limit. 1: full
         */
        uint32_t cam_conv_data_out_mode:1;
        /** cam_conv_data_in_mode : R/W; bitpos: [28]; default: 0;
         *  LIMIT or FULL mode of Data in. 0: limit. 1: full
         */
        uint32_t cam_conv_data_in_mode:1;
        /** cam_conv_mode_8bits_on : R/W; bitpos: [29]; default: 0;
         *  0: 16bits mode. 1: 8bits mode.
         */
        uint32_t cam_conv_mode_8bits_on:1;
        /** cam_conv_trans_mode : R/W; bitpos: [30]; default: 0;
         *  0: YUV to RGB. 1: RGB to YUV.
         */
        uint32_t cam_conv_trans_mode:1;
        /** cam_conv_enable : R/W; bitpos: [31]; default: 0;
         *  0: Bypass converter. 1: Enable converter.
         */
        uint32_t cam_conv_enable:1;
    };
    uint32_t val;
} lcdcam_cam_rgb_yuv_reg_t;


/** Group: Interrupt registers */
/** Type of lc_dma_int_ena register
 *  LCDCAM interrupt enable register.
 */
typedef union {
    struct {
        /** lcd_vsync_int_ena : R/W; bitpos: [0]; default: 0;
         *  The enable bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_ena:1;
        /** lcd_trans_done_int_ena : R/W; bitpos: [1]; default: 0;
         *  The enable bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_ena:1;
        /** cam_vsync_int_ena : R/W; bitpos: [2]; default: 0;
         *  The enable bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_ena:1;
        /** cam_hs_int_ena : R/W; bitpos: [3]; default: 0;
         *  The enable bit for Camera line interrupt.
         */
        uint32_t cam_hs_int_ena:1;
        /** lcd_underrun_int_ena : R/W; bitpos: [4]; default: 0;
         *  The enable bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_ena:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} lcdcam_lc_dma_int_ena_reg_t;

/** Type of lc_dma_int_raw register
 *  LCDCAM interrupt raw register, valid in level.
 */
typedef union {
    struct {
        /** lcd_vsync_int_raw : RO/WTC/SS; bitpos: [0]; default: 0;
         *  The raw bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_raw:1;
        /** lcd_trans_done_int_raw : RO/WTC/SS; bitpos: [1]; default: 0;
         *  The raw bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_raw:1;
        /** cam_vsync_int_raw : RO/WTC/SS; bitpos: [2]; default: 0;
         *  The raw bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_raw:1;
        /** cam_hs_int_raw : RO/WTC/SS; bitpos: [3]; default: 0;
         *  The raw bit for Camera line interrupt.
         */
        uint32_t cam_hs_int_raw:1;
        /** lcd_underrun_int_raw : RO/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_raw:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} lcdcam_lc_dma_int_raw_reg_t;

/** Type of lc_dma_int_st register
 *  LCDCAM interrupt status register.
 */
typedef union {
    struct {
        /** lcd_vsync_int_st : RO; bitpos: [0]; default: 0;
         *  The status bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_st:1;
        /** lcd_trans_done_int_st : RO; bitpos: [1]; default: 0;
         *  The status bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_st:1;
        /** cam_vsync_int_st : RO; bitpos: [2]; default: 0;
         *  The status bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_st:1;
        /** cam_hs_int_st : RO; bitpos: [3]; default: 0;
         *  The status bit for Camera transfer end interrupt.
         */
        uint32_t cam_hs_int_st:1;
        /** lcd_underrun_int_st : RO; bitpos: [4]; default: 0;
         *  The status bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_st:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} lcdcam_lc_dma_int_st_reg_t;

/** Type of lc_dma_int_clr register
 *  LCDCAM interrupt clear register.
 */
typedef union {
    struct {
        /** lcd_vsync_int_clr : WT; bitpos: [0]; default: 0;
         *  The clear bit for LCD frame end interrupt.
         */
        uint32_t lcd_vsync_int_clr:1;
        /** lcd_trans_done_int_clr : WT; bitpos: [1]; default: 0;
         *  The clear bit for lcd transfer end interrupt.
         */
        uint32_t lcd_trans_done_int_clr:1;
        /** cam_vsync_int_clr : WT; bitpos: [2]; default: 0;
         *  The clear bit for Camera frame end interrupt.
         */
        uint32_t cam_vsync_int_clr:1;
        /** cam_hs_int_clr : WT; bitpos: [3]; default: 0;
         *  The clear bit for Camera line interrupt.
         */
        uint32_t cam_hs_int_clr:1;
        /** lcd_underrun_int_clr : WT; bitpos: [4]; default: 0;
         *  The clear bit for LCD underrun interrupt
         */
        uint32_t lcd_underrun_int_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} lcdcam_lc_dma_int_clr_reg_t;


/** Group: Version register */
/** Type of lc_reg_date register
 *  Version register
 */
typedef union {
    struct {
        /** lc_date : R/W; bitpos: [27:0]; default: 38806054;
         *  LCD_CAM version control register
         */
        uint32_t lc_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lcdcam_lc_reg_date_reg_t;


typedef struct {
    volatile lcdcam_lcd_clock_reg_t lcd_clock;
    volatile lcdcam_cam_ctrl_reg_t cam_ctrl;
    volatile lcdcam_cam_ctrl1_reg_t cam_ctrl1;
    volatile lcdcam_cam_rgb_yuv_reg_t cam_rgb_yuv;
    volatile lcdcam_lcd_rgb_yuv_reg_t lcd_rgb_yuv;
    volatile lcdcam_lcd_user_reg_t lcd_user;
    volatile lcdcam_lcd_misc_reg_t lcd_misc;
    volatile lcdcam_lcd_ctrl_reg_t lcd_ctrl;
    volatile lcdcam_lcd_ctrl1_reg_t lcd_ctrl1;
    volatile lcdcam_lcd_ctrl2_reg_t lcd_ctrl2;
    volatile lcdcam_lcd_first_cmd_val_reg_t lcd_first_cmd_val;
    volatile lcdcam_lcd_latter_cmd_val_reg_t lcd_latter_cmd_val;
    volatile lcdcam_lcd_dly_mode_cfg1_reg_t lcd_dly_mode_cfg1;
    uint32_t reserved_034;
    volatile lcdcam_lcd_dly_mode_cfg2_reg_t lcd_dly_mode_cfg2;
    uint32_t reserved_03c[10];
    volatile lcdcam_lc_dma_int_ena_reg_t lc_dma_int_ena;
    volatile lcdcam_lc_dma_int_raw_reg_t lc_dma_int_raw;
    volatile lcdcam_lc_dma_int_st_reg_t lc_dma_int_st;
    volatile lcdcam_lc_dma_int_clr_reg_t lc_dma_int_clr;
    uint32_t reserved_074[34];
    volatile lcdcam_lc_reg_date_reg_t lc_reg_date;
} lcdcam_dev_t;

extern lcdcam_dev_t LCD_CAM;

#ifndef __cplusplus
_Static_assert(sizeof(lcdcam_dev_t) == 0x100, "Invalid size of lcdcam_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
